# GetWorksetTable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..GetWorksetTable Method
Document Class See Also
---
Get the WorksetTable of this document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WorksetTable GetWorksetTable()
```

Visual Basic
---
```text
Public Function GetWorksetTable As WorksetTable
```

Visual C++
---
```text
public:
WorksetTable^ GetWorksetTable()
```

# ### Return Value
The WorksetTable of this document.
# Remarks
There is one WorksetTable for each document. There will be at least one workset in the table, even if sharing has not yet been enabled for this document.
# See Also
Document Class
Autodesk.Revit.DB Namespace